In [1]:
import pandas as pd

# Series

In [2]:
data = [1, 2, 3, 4, 5]

In [3]:
s = pd.Series(data)

s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
index = ['Linha' + str(i) for i in range(5)]

In [5]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [6]:
s = pd.Series(data, index)

In [7]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [8]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}

data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [9]:
s = pd.Series(data)

In [10]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [11]:
s1 = s + 2

s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [13]:
s2 = s + s1

s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# Dataframe

In [16]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [17]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [18]:
df1 = pd.DataFrame(data)

In [19]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [20]:
index = ['Linha ' + str(i) for i in range(df1.shape[0])]

In [24]:
columns = ['Coluna ' + str(i) for i in range(df1.shape[1])]

In [27]:
df1 = pd.DataFrame(data, index=index, columns=columns)

df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [38]:
data = {'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
        'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
        'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [39]:
df2 = pd.DataFrame(data)

df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [32]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [34]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [35]:
df1[df1 > 0] = 'A'

df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [40]:
df2[df2 > 0] = 'B'

df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [41]:
df3[df3 > 0] = 'C'

df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [42]:
df4 = pd.concat([df1, df2, df3])

df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [43]:
df4 = pd.concat([df1, df2, df3], axis = 1)

df4

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C